## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_subnet.appsubnet will be created
  + resource "azurerm_subnet" "appsubnet" {
      + address_prefixes                              = [
          + "10.0.11.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "aa-dev-vnet-default-appsubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "aatest1"
      + virtual_network_name                          = "aa-dev-vnet-default"
    }

  # azurerm_subnet.websubnet will be created
  + resource "azurerm_subnet" "websubnet" {
      + address_prefixes                              = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "aa-dev-vnet-default-websubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "aatest1"
      + virtual_network_name                          = "aa-dev-vnet-default"
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "aa-dev-vnet-default"
      + resource_group_name = "aatest1"
      + subnet              = (known after apply)
      + tags                = {
          + "environment" = "dev"
          + "owners"      = "aa"
        }
    }

  # random_string.myrandom will be created
  + resource "random_string" "myrandom" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + virtual_network_id   = (known after apply)
  + virtual_network_name = "aa-dev-vnet-default"
  + web_subnet_id        = (known after apply)
  + web_subnet_name      = "aa-dev-vnet-default-websubnet"
```
</details>